XmlSignLibrary/XmlSignLibrary/Examples/ShortDoc.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:chan="http://minprom.gov.ru/smev/pgu/changeorderinfo" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:inc="http://www.w3.org/2004/08/xop/include" xmlns:smev="http://smev.gosuslugi.ru/rev111111" xmlns:typ="http://minprom.gov.ru/smev/pgu/changeorderstatusV243/xsd/types" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soapenv:Header></soapenv:Header><soapenv:Body><typ:ChangeOrderStatusV243Request><smev:Message><smev:Sender><smev:Code>EPGU_SYS_1</smev:Code><smev:Name>ЕПГУ</smev:Name></smev:Sender><smev:Recipient><smev:Code>MINPROM_SYS_1</smev:Code><smev:Name>Минпромторг России</smev:Name></smev:Recipient><smev:Originator><smev:Code>EPGU_SYS_1</smev:Code><smev:Name>ЕПГУ</smev:Name></smev:Originator><smev:TypeCode>GSRV</smev:TypeCode><smev:Status>REQUEST</smev:Status><smev:Date>2012-06-05T17:14:19+04:00</smev:Date><smev:ExchangeType>1</smev:ExchangeType><smev:ServiceCode>10001014881</smev:ServiceCode></smev:Message><smev:MessageData><smev:AppData wsu:Id="AppData"><chan:changeOrderInfo><chan:serviceInfo><chan:serviceOrgCode>MPT0</chan:serviceOrgCode><chan:eServiceId/><chan:reestrId>10001014881</chan:reestrId></chan:serviceInfo><chan:orderId><chan:pguId>7d6476ac-a728-4863-804e-a5789d29c630</chan:pguId><chan:orgId/></chan:orderId><chan:statusCode><chan:orgCode/><chan:techCode>2</chan:techCode></chan:statusCode><chan:comment>Заявление отправлено в ведомство</chan:comment><chan:cancelAllowed>false</chan:cancelAllowed><chan:authToken>TEST_TOKEN_1</chan:authToken></chan:changeOrderInfo><smev:error><smev:errorCode/><smev:errorMessage/></smev:error></smev:AppData><smev:AppDocument><smev:RequestCode>req_7d6476ac-a728-4863-804e-a5789d29c630</smev:RequestCode><smev:BinaryData>UEsDBBQACAAIAHZ6r0AAAAAAAAAAAAAAAAAsABAAcmVxXzdkNjQ3NmFjLWE3MjgtNDg2My04MDRlLWE1Nzg5ZDI5YzYzMC54bWxVWAwAVjyyT887sk/1ARQAZY</smev:BinaryData></smev:AppDocument></smev:MessageData></typ:ChangeOrderStatusV243Request></soapenv:Body></soapenv:Envelope>